Revit 2027 API
BuiltInFailures.EditingFailures.UnableToMakeSourceWorksetEditable Property
 Unable to make the necessary Workset ([Name]) editable in the Linked File in order to change the Shared Coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnableToMakeSourceWorksetEditable { get; }
Public Shared ReadOnly Property UnableToMakeSourceWorksetEditable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnableToMakeSourceWorksetEditable {
	FailureDefinitionId^ get ();
}
static member UnableToMakeSourceWorksetEditable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace